app/views/users/index.html.erb

    <td><%= u.username %></td>
    <td><%= u.role.last do |y| y.role end%></td>
---
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 3 ORDER BY "roles"."id" DESC LIMIT 1