app/views/customers/_form.html.erb

SELECT "locations".* FROM "locations" ORDER BY name
---
   <%= f.input :location_id do %>
     <%= f.select :location_id,  Location.order("name").map {|l|[l.name + " -  " + l.departament, l.id]}, prompt: t('view.customers.prompt_location') %>

SELECT "plans".* FROM "plans" WHERE "plans"."remove" = 't'
---
   <%= f.input :plan_id do %>
     <%= f.select :plan_id,  Plan.where(remove: true).map {|p|[p.name + " - " + p.download_speed , p.id]}, prompt: t('view.customers.prompt_plans') %>