app/views/tickets/_form.html.erb

            <%= f.input :role_id do %>
            <%= f.select :role_id,  Role.all.map {|l|[l.role, l.id]}, prompt: 'Seleccione el Departamento' %>
---
SELECT "roles".* FROM "roles"