app/views/tickets/_ticket.html.erb

    <td><%= ticket.status %></td>
    <td><%= ticket.ticket_and_role.last %></td>
---
SELECT "ticket_and_roles".* FROM "ticket_and_roles" WHERE "ticket_and_roles"."ticket_id" = 1 ORDER BY "ticket_and_roles"."id" DESC LIMIT 1