app/controllers/accounts_receivables_controller.rb

 def index
    @accounts_receivables = @customer.accounts_receivable.all
---
SELECT "accounts_receivables".* FROM "accounts_receivables" WHERE "accounts_receivables"."customer_id" = 1

  def create
    @accounts_receivable = @customer.accounts_receivable.new(params[:accounts_receivable].merge(:user_id => current_user.id))

    respond_to do |format|
      if @accounts_receivable.save
---
INSERT INTO "accounts_receivables" ("amount", "created_at", "customer_id", "description", "number_invoice", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def load_customer
    @customer = Customer.find(params[:customer_id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", "1"]]