app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
def index
   @customers = Customer.con_nombre(params[:q]) if params[:q].present?