app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT "roles".* FROM "roles"

  def show
    @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "3"]]

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("created_at", "role", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 23 Jul 2013 10:05:23 ART -03:00], ["role", "Visitas Técnicas"], ["updated_at", Tue, 23 Jul 2013 10:05:23 ART -03:00]]