app/controllers/tickets_controller.rb

  def edit
    @ticket = @customer.tickets.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."customer_id" = 1 AND "tickets"."id" = $1 LIMIT 1  [["id", "1"]]

  def create

    @ticket = @customer.tickets.new(params[:ticket].merge(:user_id => current_user.id))
    @ticket.ticket_and_role.build({ticket_id:@ticket.id, role_id:@ticket.role_id, user_id: current_user.id})


 respond_to do |format|
      if @ticket.save
---
INSERT INTO "ticket_and_roles" ("created_at", "role_id", "ticket_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 23 Jul 2013 09:44:50 ART -03:00], ["role_id", 1], ["ticket_id", 1], ["updated_at", Tue, 23 Jul 2013 09:44:50 ART -03:00], ["user_id", 1]]
INSERT INTO "tickets" ("ancestry", "created_at", "customer_id", "issue", "message", "path_id", "priority", "prioritycss", "reply", "role_id", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    @datos = params[:ticket][:role_id]
    @ticket = @customer.tickets.find(params[:id])
    @ticket.ticket_and_role.build({ticket_id: @ticket.id, role_id: @datos, user_id: current_user.id})

respond_to do |format|
      if @ticket.update_attributes(params[:ticket])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."customer_id" = 1 AND "tickets"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tickets" SET "status" = 'open', "updated_at" = '2013-07-23 13:21:50.150402' WHERE "tickets"."id" = 1

  def all
    @tickets = Ticket.where(role_id: current_user.role , status: false   )
    @tickets_urgent= Ticket.where(role_id: current_user.role , priority: 'Urgente', status: false  )
---
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 1
SELECT "tickets".* FROM "tickets" WHERE "tickets"."role_id" IS NULL AND "tickets"."status" = '0'
SELECT "tickets".* FROM "tickets" WHERE "tickets"."role_id" IS NULL AND "tickets"."priority" = 'Urgente' AND "tickets"."status" = '0'

  def reply
    @ticket = @customer.tickets.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."customer_id" = 1 AND "tickets"."id" = $1 LIMIT 1  [["id", "1"]]

  def history_ticket
      @history = @customer.tickets.find(params[:id])
      @history_ticket = @history.ticket_and_role.all
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."customer_id" = 1 AND "tickets"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
SELECT "ticket_and_roles".* FROM "ticket_and_roles" WHERE "ticket_and_roles"."ticket_id" = 3

  def load_customer
    @customer = Customer.find(params[:customer_id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", "1"]]