app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def technical_visit
   @tickets = Ticket.all