app/controllers/users_controller.rb

INSERT INTO "users" ("address", "created_at", "cuit", "current_sign_in_at", "current_sign_in_ip", "dni", "email", "enabled", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "lastname", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role_id", "sign_in_count", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @user = Customer.new(params[:user])
puts @user.inspect
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "encrypted_password" = '$2a$10$rBMp1adCmY6W97NkgX7Jgu.rochtUNomBWxXyjboVnNX.9r2v4G2i', "enabled" = 't', "updated_at" = '2013-07-23 14:53:37.944218' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def destroy
     @user = User.find(params[:id])